ode-soap-performance/bpelContent/GeometricProgression.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2.4-b01. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.wscomposition.org/GeometricProgression/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://www.wscomposition.org/GeometricProgression/" name="GeometricProgression">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://www.wscomposition.org/GeometricProgression/" schemaLocation="GeometricProgression.xsd"></xsd:import>
        </xsd:schema>
    </types>
    <message name="GeometricProgressionRequest">
        <part name="n" type="xsd:int"></part>
        <part name="r" type="xsd:int"></part>
        <part name="a" type="xsd:int"></part>
    </message>
    <message name="GeometricProgressionRequestResponse">
        <part name="return" type="tns:geometricProgressionResponse"></part>
    </message>
    <portType name="GeometricProgressionServiceImpl">
        <operation name="GeometricProgressionRequest" parameterOrder="n r a">
            <input wsam:Action="http://www.wscomposition.org/GeometricProgression/GeometricProgressionServiceImpl/GeometricProgressionRequestRequest" message="tns:GeometricProgressionRequest"></input>
            <output wsam:Action="http://www.wscomposition.org/GeometricProgression/GeometricProgressionServiceImpl/GeometricProgressionRequestResponse" message="tns:GeometricProgressionRequestResponse"></output>
        </operation>
    </portType>
    <binding name="GeometricProgressionSOAPBinding" type="tns:GeometricProgressionServiceImpl">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"></soap:binding>
        <operation name="GeometricProgressionRequest">
            <soap:operation soapAction=""></soap:operation>
            <input>
                <soap:body use="literal" namespace="http://www.wscomposition.org/GeometricProgression/"></soap:body>
            </input>
            <output>
                <soap:body use="literal" namespace="http://www.wscomposition.org/GeometricProgression/"></soap:body>
            </output>
        </operation>
    </binding>
    <service name="GeometricProgression">
        <port name="GeometricProgressionSOAP" binding="tns:GeometricProgressionSOAPBinding">
            <soap:address location="http://192.168.243.85:8080/geometricprogression/GeometricProgression"></soap:address>
        </port>
    </service>
</definitions>