mule-soap-performance/src/main/resources/GeometricProgressionRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:geom="http://www.wscomposition.org/GeometricProgression/">
   <soapenv:Header/>
   <soapenv:Body>
      <geom:GeometricProgressionRequest>
         <n></n>
         <r></r>
         <a></a>
      </geom:GeometricProgressionRequest>
   </soapenv:Body>
</soapenv:Envelope>